{"Pinus strobus": "Pinus strobus, commonly denominated the eastern white pine, northern white pine, white pine, Weymouth pine (British), and soft pine is a large pine native to eastern North America. It occurs from Newfoundland, Canada west through the Great Lakes region to southeastern Manitoba and Minnesota, United States, and south along the Appalachian Mountains and upper Piedmont to northernmost Georgia and perhaps very rarely in some of the higher elevations in northeastern Alabama.The Native American Haudenosaunee denominated it the \"Tree of Peace\". It is known as the \"Weymouth pine\" in the United Kingdom, after Captain George Weymouth of the British Royal Navy, who brought its seeds to England from Maine in 1605.", "Pinus rigida": "Pinus rigida, the pitch pine, is a small-to-medium-sized (6–30 m or 20–98 ft) pine. It is native to eastern North America, from central Maine south to Georgia and as far west as Kentucky, and in two pockets along the St. Lawrence River in southern Quebec and Ontario. It is found in environments which other species would find unsuitable for growth such as acidic, sandy, and low nutrient soils. This species occasionally hybridizes with other pine species such as loblolly pine (Pinus taeda), shortleaf pine (Pinus echinata), and pond pine (Pinus serotina); the last is treated as a subspecies of pitch pine by some botanists.", "Pinus serotina": "Pinus serotina, the pond pine, marsh pine or pocosin pine, is a tree found along the Southeastern portion of the Atlantic coastal plain of the United States, from southern New Jersey south to Florida and west to southern Alabama. This pine often has a crooked growth pattern and an irregular top and grows up to 21 metres (69 ft) high, rarely to 29 metres (95 ft).The needles are in bundles of three or four, and 15–20 cm (6–8 in) long. The almost round cones are 5–8 cm (2–3 1⁄4 in) long with small prickles on the scales. Its cones are usually serotinous, requiring fire to open. The pond pine is found in wet habitats near ponds, bays, swamps, and pocosins.The species name serotina is derived from the persistently unopened cones that may remain closed for several years before they release their seeds; the opening is often in response to forest fires.\nAt the north end of its range, it intergrades and hybridises with pitch pine (P. rigida); it is distinguished from that species by the longer needles and on average slightly larger cones. Some botanists treat pond pine as a subspecies of pitch pine.", "Pinus taeda": "Pinus taeda, commonly known as loblolly pine, is one of several pines native to the Southeastern United States, from central Texas east to Florida, and north to Delaware and southern New Jersey. The wood industry classifies the species as a southern yellow pine. U.S. Forest Service surveys found that loblolly pine is the second-most common species of tree in the United States, after red maple. For its timber, the pine species is regarded as the most commercially important tree in Southeastern US.The common name loblolly is given because the pine species is found mostly in lowlands and swampy areas.Loblolly pine is the first among over 100 species of Pinus to have its complete genome sequenced. As of March 2014, it was the organism having the largest sequenced genome size. Its genome, with 22 billion base pairs, is seven times larger than that of humans. As of 2018, assembly of the Axolotl genome (32Gb) displaced loblolly pine as the largest assembled genome.", "Pinus palustris": "The longleaf pine (Pinus palustris) is a pine native to the Southeastern United States, found along the coastal plain from East Texas to southern Maryland, extending into northern and central Florida. It reaches a height of 30–35 m (98–115 ft) and a diameter of 0.7 m (28 in). In the past, before extensive logging, they reportedly grew to 47 m (154 ft) with a diameter of 1.2 m (47 in). The tree is a cultural symbol of the Southern United States, being the official state tree of Alabama and the unofficial state tree of North Carolina.", "Pinus banksiana": "Jack pine (Pinus banksiana) is an eastern North American pine. Its native range in Canada is east of the Rocky Mountains from the Mackenzie River in the Northwest Territories to Cape Breton Island in Nova Scotia, and the north-central and northeast of the United States from Minnesota to Maine, with the southernmost part of the range just into northwest Indiana and northwest Pennsylvania. It is also known as grey pine and scrub pine.In the far west of its range, Pinus banksiana hybridizes readily with the closely related lodgepole pine (Pinus contorta).  The species epithet banksiana is after the English botanist Sir Joseph Banks.", "Pinus sylvestris": "Scots pine (Pinus sylvestris) is a species of pine that is native to Eurasia, ranging from Western Europe to Eastern Siberia, south to the Caucasus Mountains and Anatolia, and north to well inside the Arctic Circle in Scandinavia. In the north of its range, it occurs from sea level to 1,000 m (3,300 ft), while in the south of its range it is a high altitude mountain tree, growing at 1,200–2,600 m (3,900–8,500 ft) altitude. It is readily identified by its combination of fairly short, blue-green leaves and orange-red bark.The species is mainly found on poorer, sandy soils, rocky outcrops, peat bogs or close to the forest limit. On fertile sites, Scots pine is out-competed by other, usually spruce or broad-leaved tree species.It is the national tree of Scotland.", "Pinus nigra nigra": "Pinus nigra, the Austrian pine or black pine, is a moderately variable species of pine, occurring across southern Mediterranean Europe from Spain to the eastern Mediterranean on Anatolian peninsula of Turkey and on Corsica/Cyprus, including Crimea, and in the high mountains of the Maghreb in North Africa.", "Pinus resinosa": "Pinus resinosa, known as red pine or Norway pine, is a pine native to North America. It occurs from Newfoundland west to Manitoba, and south to Pennsylvania, with several smaller, disjunct populations occurring in the Appalachian Mountains in Virginia and West Virginia, as well as a few small pockets in extreme northern New Jersey and northern Illinois.", "Pinus pungens": "Table Mountain pine, Pinus pungens, also called hickory pine, prickly pine, or mountain pine, is a small pine native to the Appalachian Mountains in the United States.", "Pinus virginiana": "Pinus virginiana, the Virginia pine, scrub pine, Jersey pine, is a medium-sized tree, often found on poorer soils from Long Island in southern New York south through the Appalachian Mountains to western Tennessee and Alabama. The usual size range for this pine is 9–18 m, but can grow taller under optimum conditions. The trunk can be as large as 0.5 m diameter. This tree prefers well-drained loam or clay, but will also grow on very poor, sandy soil, where it remains small and stunted. The typical life span is 65 to 90 years.\nThe short (4–8 cm), yellow-green needles are paired in fascicles and are often twisted. Pinecones are 4–7 cm long and may persist on the tree for many years, often (though not always) releasing their seeds in the second year. In growth habit, some trees may be inclined with twisted trunks.\nThis pine is useful for reforesting and provides nourishment for wildlife. Its other main use is on Christmas tree farms, despite having sharp-tipped needles and yellowish winter color. It also can provide wood pulp and lumber. Like some other southern yellow pines, Virginia pine lumber case hardens. That is it becomes very hard over time during wood drying. Wood from Virginia pine is not normally considered to resist rot unless treated with preservatives.", "Pinus echinata": "Pinus echinata, the shortleaf pine, is a species of pine native to the eastern United States from southernmost New York State, south to northern Florida, west to eastern Oklahoma, and southwest to eastern Texas. The tree is variable in form, sometimes straight, sometimes crooked, with an irregular crown. This tree reaches heights of 20–30 metres (65–100 ft) with a trunk diameter of 0.5–0.9 metres (1 ft 8 in–2 ft 11 in).\nThe leaves are needle-like, in fascicles (bundles) of two and three mixed together, and from 7–11 cm (2 3⁄4–4 1⁄4 in) long. The cones are 4–7 cm (1 1⁄2–2 3⁄4 in) long, with thin scales with a transverse keel and a short prickle.  They open at maturity but are persistent. Shortleaf pine seedlings develop a persistent J-shaped crook near the ground surface. Axillary and other buds form near the crook and initiate growth if the upper stem is killed by fire or is severed.\nThis pine is a source of wood pulp, plywood veneer, and lumber for a variety of uses. The shortleaf pine is one of the southern US \"southern yellow pines; it is also occasionally called southern yellow pine or the shortstraw pine. Shortleaf pine has the largest range of the southern US yellow pines.\n\nThis pine occupies a variety of habitats from rocky uplands to wet flood plains. It frequently hybridizes naturally with loblolly pine and pitch pine where their ranges intersect.", "Pinus glabra": "Pinus glabra, the spruce pine,  is a tree found on the coastal plains of the southern United States, from southern South Carolina south to northern Florida and west to southern Louisiana. This pine is a straight-growing, medium-sized species, attaining heights of 20–40 m.\nThe leaves are needle-like, in bundles of two, 5–8 cm long, slender (1 mm thick), and glossy dark green. The small, slender cones are 4–6 cm long, with weak prickles on the scales that are soon shed.Pinus glabra differs markedly from most other pines in that it does not occur in largely pure pine forests, but is typically found as scattered trees in moist woodland habitats in mixed hardwood forest. To be able to compete successfully in such habitats, it has adapted greater shade tolerance than most other pines.", "Pinus elliotii": "Pinus elliottii, commonly known as the slash pine, is a pine tree native to the southeastern United States. Slash pine is named after the \"slashes\" – swampy ground overgrown with trees and bushes – that constitute its habitat."}